Repository: pmitros/DoneXBlock
Catalog: done/translations/*/LC_MESSAGES/text.po
Languages: fr_ca

source: Is the student done?
fr_ca: Est-ce que l'étudiant a terminé ?

source: Align left/right/center
fr_ca: Aligner à gauche/droite/centre

source: Completion
fr_ca: Complétion

source: Display name
fr_ca: Nom d'affichage

source: ISO-8601 formatted string representing the start date of this assignment. We ignore this.
fr_ca: Chaîne formatée ISO-8601 représentant la date de début de ce devoir. Nous l'ignorons.

source: ISO-8601 formatted string representing the due date of this assignment. We ignore this.
fr_ca: Chaîne formatée ISO-8601 représentant la date de remise de ce devoir. Nous l'ignorons.

source: Problem Weight
fr_ca: Poids du problème

source: Defines the number of points each problem is worth. If the value is not set, the problem is worth the sum of the option point values.
fr_ca: Définit le nombre de points que chaque problème vaut. Si la valeur n'est pas définie, le problème vaut la somme des valeurs des points d'option.

source: I have completed this
fr_ca: J'ai complété ceci

source: Unmark
fr_ca: Décocher

source: Mark as complete
fr_ca: Marqué comme complété

source: This is a very simple component with no configuration options. It is used for helping student keep track of what portion of a course they've completed. For example, you might place this underneath each text and video component, and students can see in their progress page which portions are completed and which still need to be watched or read.
fr_ca: Ceci est in composant très simple sans options de conffiguration. Il est utilisé pour aider les étudiants à garder une trace de la portion du cours qu'ils ont complété. Par exemple, vous pourriez le placer sous chaque composant texte et vidéo, et les étudiants peuvent voir dans leur page de progression quelles parties sont complétées et qui doivent encore être regardées ou lues.

source: It is also helpful to give students a way to sign off on having completed something. They are less likely to skip material that way.
fr_ca: Il est également utile de donner aux étudiants un moyen de signaler qu'ils ont complété quelque chose. Ils sont moins susceptibles de sauter du matériel de cette façon.

source: (If you're a real power-user, in OLX, we do allow you to add an align tag, which can left-, center-, or right-justify the XBlock)
fr_ca: (Si vous êtes un véritable utilisateur chevronné, dans OLX, nous vous permettons de ajoutez une balise d’alignement qui peut justifier à gauche, au centre ou à droite le XBlock)
